# All necessary imports

In [1]:
import sys
sys.path.append('..')

In [2]:
from source.code.utils import save_obj
from source.code.utils import load_obj

In [3]:
import pandas as pd
import numpy as np
import os
import pandas_profiling
from tqdm import tqdm

In [4]:
pd.set_option('display.max_colwidth', -1)
pd.set_option('display.max_rows', 30000)
pd.set_option('display.max_columns', 30000)

In [5]:
data_path = '../data/dataset/processed/{}.csv'
profiling_path = '../data/dataset/processed/data_profiling/{}.html'
meta_path = '../data/dataset/processed/meta-info/{}.pkl'

# Data reading

## Datasets

In [6]:
dataset_names = ['application_train', 'application_test', 'bureau', 'bureau_balance', 'credit_card_balance', 'installments_payments', 'POS_CASH_balance', 'previous_application', 'sample_submission']

In [7]:
data_dict = dict(zip(dataset_names, list(map(lambda name: pd.read_csv(filepath_or_buffer=data_path.format(name)), tqdm(dataset_names)))))

100%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 9/9 [00:26<00:00,  2.97s/it]

In [9]:
columns_description = pd.read_csv(filepath_or_buffer='../data/dataset/processed/HomeCredit_columns_description.csv', encoding='ISO-8859-1', index_col=0)

## Columns needed

In [10]:
datasets_num_features = load_obj(meta_path.format('datasets_num_features'))

In [11]:
datasets_cat_features = load_obj(meta_path.format('datasets_cat_features'))

In [12]:
datasets_bin_features = load_obj(meta_path.format('datasets_bin_features'))

# Common train & test categories

In [13]:
commom_categories = load_obj(meta_path.format('commom_categories'))

# Data examples

## Numeric columns

In [14]:
name_number = 0

In [15]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].head().T # application_train

,0,1,2,3,4
AMT_CREDIT,406597.500000,1.293502e+06,135000.000000,312682.500000,513000.000000
AMT_INCOME_TOTAL,202500.000000,2.700000e+05,67500.000000,135000.000000,121500.000000
CNT_CHILDREN,0.000000,0.000000e+00,0.000000,0.000000,0.000000
DAYS_BIRTH,-9461.000000,-1.676500e+04,-19046.000000,-19005.000000,-19932.000000
DAYS_EMPLOYED,-637.000000,-1.188000e+03,-225.000000,-3039.000000,-3038.000000
DAYS_ID_PUBLISH,-2120.000000,-2.910000e+02,-2531.000000,-2437.000000,-3458.000000
DAYS_REGISTRATION,-3648.000000,-1.186000e+03,-4260.000000,-9833.000000,-4311.000000
HOUR_APPR_PROCESS_START,10.000000,1.100000e+01,9.000000,17.000000,11.000000
REGION_POPULATION_RELATIVE,0.018801,3.541000e-03,0.010032,0.008019,0.028663
REGION_RATING_CLIENT,2.000000,1.000000e+00,2.000000,2.000000,2.000000
SK_ID_CURR,100002.000000,1.000030e+05,100004.000000,100006.000000,100007.000000

In [16]:
name_number = 1

In [17]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].head().T # application_test

,0,1,2,3,4
AMT_CREDIT,568800.00000,222768.000000,663264.000000,1.575000e+06,625500.000000
AMT_INCOME_TOTAL,135000.00000,99000.000000,202500.000000,3.150000e+05,180000.000000
CNT_CHILDREN,0.00000,0.000000,0.000000,2.000000e+00,1.000000
CNT_FAM_MEMBERS,2.00000,2.000000,2.000000,4.000000e+00,3.000000
DAYS_BIRTH,-19241.00000,-18064.000000,-20038.000000,-1.397600e+04,-13040.000000
DAYS_EMPLOYED,-2329.00000,-4469.000000,-4458.000000,-1.866000e+03,-2191.000000
DAYS_ID_PUBLISH,-812.00000,-1623.000000,-3503.000000,-4.208000e+03,-4262.000000
DAYS_LAST_PHONE_CHANGE,-1740.00000,0.000000,-856.000000,-1.805000e+03,-821.000000
DAYS_REGISTRATION,-5170.00000,-9118.000000,-2175.000000,-2.000000e+03,-4000.000000
HOUR_APPR_PROCESS_START,18.00000,9.000000,14.000000,1.100000e+01,5.000000
REGION_POPULATION_RELATIVE,0.01885,0.035792,0.019101,2.639200e-02,0.010032
REGION_RATING_CLIENT,2.00000,2.000000,2.000000,2.000000e+00,2.000000
SK_ID_CURR,100001.00000,100005.000000,100013.000000,1.000280e+05,100038.000000

In [18]:
name_number = 2

In [19]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].head().T # bureau

                                0          1          2          3          4
AMT_CREDIT_SUM_OVERDUE  0.0        0.0        0.0        0.0        0.0
CNT_CREDIT_PROLONG      0.0        0.0        0.0        0.0        0.0
CREDIT_DAY_OVERDUE      0.0        0.0        0.0        0.0        0.0
DAYS_CREDIT            -497.0     -208.0     -203.0     -203.0     -629.0
DAYS_CREDIT_UPDATE     -131.0     -20.0      -16.0      -16.0      -21.0
SK_ID_BUREAU            5714462.0  5714463.0  5714464.0  5714465.0  5714466.0
SK_ID_CURR              215354.0   215354.0   215354.0   215354.0   215354.0

In [20]:
name_number = 3

In [21]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].head().T # bureau_balance

                      0        1        2        3        4
MONTHS_BALANCE  0       -1       -2       -3       -4
SK_ID_BUREAU    5715448  5715448  5715448  5715448  5715448

In [22]:
name_number = 4

In [23]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].head().T # credit_card_balance

,0,1,2,3,4
AMT_BALANCE,56.97,63975.555,31815.225,236572.11,453919.455
AMT_CREDIT_LIMIT_ACTUAL,135000.00,45000.000,450000.000,225000.00,450000.000
AMT_DRAWINGS_CURRENT,877.50,2250.000,0.000,2250.00,11547.000
CNT_DRAWINGS_CURRENT,1.00,1.000,0.000,1.00,1.000
MONTHS_BALANCE,-6.00,-1.000,-7.000,-4.00,-1.000
SK_DPD,0.00,0.000,0.000,0.00,0.000
SK_DPD_DEF,0.00,0.000,0.000,0.00,0.000
SK_ID_CURR,378907.00,363914.000,371185.000,337855.00,126868.000
SK_ID_PREV,2562384.00,2582071.000,1740877.000,1389973.00,1891521.000

In [24]:
name_number = 5

In [25]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].head().T # installments_payments

,0,1,2,3,4
AMT_INSTALMENT,6948.36,1716.525,25425.0,24350.13,2165.04
DAYS_INSTALMENT,-1180.00,-2156.000,-63.0,-2418.00,-1383.00
NUM_INSTALMENT_NUMBER,6.00,34.000,1.0,3.00,2.00
NUM_INSTALMENT_VERSION,1.00,0.000,2.0,1.00,1.00
SK_ID_CURR,161674.00,151639.000,193053.0,199697.00,167756.00
SK_ID_PREV,1054186.00,1330831.000,2085231.0,2452527.00,2714724.00

In [26]:
name_number = 6

In [27]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].head().T # POS_CASH_balance

                      0        1        2        3        4
MONTHS_BALANCE -31      -33      -32      -35      -35
SK_DPD          0        0        0        0        0
SK_DPD_DEF      0        0        0        0        0
SK_ID_CURR      182943   367990   397406   269225   334279
SK_ID_PREV      1803195  1715348  1784872  1903291  2341044

In [28]:
name_number = 7

In [29]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].head().T # previous_application

                                 0          1          2          3          4
AMT_APPLICATION          17145.0    607500.0   112500.0   450000.0   337500.0
DAYS_DECISION           -73.0      -164.0     -301.0     -512.0     -781.0
HOUR_APPR_PROCESS_START  15.0       11.0       11.0       7.0        9.0
SELLERPLACE_AREA         35.0      -1.0       -1.0       -1.0       -1.0
SK_ID_CURR               271877.0   108129.0   122040.0   176158.0   202054.0
SK_ID_PREV               2030495.0  2802425.0  2523466.0  2819243.0  1784265.0

In [30]:
name_number = 8

In [31]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].head().T # sample_submission

                 0       1       2       3       4
SK_ID_CURR  100001  100005  100013  100028  100038

## Categorical columns

In [32]:
name_number = 0

In [33]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].head().T # application_train

,0,1,2,3,4
NAME_EDUCATION_TYPE,Secondary / secondary special,Higher education,Secondary / secondary special,Secondary / secondary special,Secondary / secondary special
NAME_FAMILY_STATUS,Single / not married,Married,Single / not married,Civil marriage,Single / not married
NAME_HOUSING_TYPE,House / apartment,House / apartment,House / apartment,House / apartment,House / apartment
NAME_INCOME_TYPE,Working,State servant,Working,Working,Working
ORGANIZATION_TYPE,Business Entity Type 3,School,Government,Business Entity Type 3,Religion
WEEKDAY_APPR_PROCESS_START,WEDNESDAY,MONDAY,MONDAY,WEDNESDAY,THURSDAY

In [34]:
name_number = 1

In [35]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].head().T # application_test

,0,1,2,3,4
NAME_EDUCATION_TYPE,Higher education,Secondary / secondary special,Higher education,Secondary / secondary special,Secondary / secondary special
NAME_FAMILY_STATUS,Married,Married,Married,Married,Married
NAME_HOUSING_TYPE,House / apartment,House / apartment,House / apartment,House / apartment,House / apartment
NAME_INCOME_TYPE,Working,Working,Working,Working,Working
ORGANIZATION_TYPE,Kindergarten,Self-employed,Transport: type 3,Business Entity Type 3,Business Entity Type 3
WEEKDAY_APPR_PROCESS_START,TUESDAY,FRIDAY,MONDAY,WEDNESDAY,FRIDAY

In [36]:
name_number = 2

In [37]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].head().T # bureau

,0,1,2,3,4
CREDIT_ACTIVE,Closed,Active,Active,Active,Active
CREDIT_CURRENCY,currency 1,currency 1,currency 1,currency 1,currency 1
CREDIT_TYPE,Consumer credit,Credit card,Consumer credit,Credit card,Consumer credit

In [38]:
name_number = 3

In [39]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].head().T # bureau_balance

        0  1  2  3  4
STATUS  C  C  C  C  C

In [40]:
name_number = 4

In [41]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].head().T # credit_card_balance

                           0       1       2       3       4
NAME_CONTRACT_STATUS  Active  Active  Active  Active  Active

In [42]:
name_number = 5

In [43]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].head().T # installments_payments

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

In [44]:
name_number = 6

In [45]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].head().T # POS_CASH_balance

                           0       1       2       3       4
NAME_CONTRACT_STATUS  Active  Active  Active  Active  Active

In [46]:
name_number = 7

In [47]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].head().T # previous_application

,0,1,2,3,4
CHANNEL_TYPE,Country-wide,Contact center,Credit and cash offices,Credit and cash offices,Credit and cash offices
CODE_REJECT_REASON,XAP,XAP,XAP,XAP,HC
NAME_CASH_LOAN_PURPOSE,XAP,XNA,XNA,XNA,Repairs
NAME_CLIENT_TYPE,Repeater,Repeater,Repeater,Repeater,Repeater
NAME_CONTRACT_STATUS,Approved,Approved,Approved,Approved,Refused
NAME_CONTRACT_TYPE,Consumer loans,Cash loans,Cash loans,Cash loans,Cash loans
NAME_GOODS_CATEGORY,Mobile,XNA,XNA,XNA,XNA
NAME_PAYMENT_TYPE,Cash through the bank,XNA,Cash through the bank,Cash through the bank,Cash through the bank
NAME_PORTFOLIO,POS,Cash,Cash,Cash,Cash
NAME_PRODUCT_TYPE,XNA,x-sell,x-sell,x-sell,walk-in
NAME_SELLER_INDUSTRY,Connectivity,XNA,XNA,XNA,XNA
NAME_YIELD_GROUP,middle,low_action,high,middle,high
WEEKDAY_APPR_PROCESS_START,SATURDAY,THURSDAY,TUESDAY,MONDAY,THURSDAY

In [48]:
name_number = 8

In [49]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].head().T # sample_submission

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

## Binary columns

In [50]:
name_number = 0

In [51]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].head().T # application_train

                             0  1  2  3  4
CODE_GENDER                  0  1  0  1  0
FLAG_CONT_MOBILE             1  1  1  1  1
FLAG_DOCUMENT_10             0  0  0  0  0
FLAG_DOCUMENT_11             0  0  0  0  0
FLAG_DOCUMENT_12             0  0  0  0  0
FLAG_DOCUMENT_13             0  0  0  0  0
FLAG_DOCUMENT_14             0  0  0  0  0
FLAG_DOCUMENT_15             0  0  0  0  0
FLAG_DOCUMENT_16             0  0  0  0  0
FLAG_DOCUMENT_17             0  0  0  0  0
FLAG_DOCUMENT_18             0  0  0  0  0
FLAG_DOCUMENT_19             0  0  0  0  0
FLAG_DOCUMENT_2              0  0  0  0  0
FLAG_DOCUMENT_20             0  0  0  0  0
FLAG_DOCUMENT_21             0  0  0  0  0
FLAG_DOCUMENT_3              1  1  0  1  0
FLAG_DOCUMENT_4              0  0  0  0  0
FLAG_DOCUMENT_5              0  0  0  0  0
FLAG_DOCUMENT_6              0  0  0  0  0
FLAG_DOCUMENT_7              0  0  0  0  0
FLAG_DOCUMENT_8              0  0  0  0  1
FLAG_DOCUMENT_9              0  0  0  0  0
FLAG_EMAIL                   0  0  0  0  0
FLAG_EMP_PHONE               1  1  1  1  1
FLAG_MOBIL                   1  1  1  1  1
FLAG_OWN_CAR                 0  0  1  0  0
FLAG_OWN_REALTY              1  0  1  1  1
FLAG_PHONE                   1  1  1  0  0
FLAG_WORK_PHONE              0  0  1  0  0
LIVE_CITY_NOT_WORK_CITY      0  0  0  0  1
LIVE_REGION_NOT_WORK_REGION  0  0  0  0  0
NAME_CONTRACT_TYPE           1  1  0  1  1
REG_CITY_NOT_LIVE_CITY       0  0  0  0  0
REG_CITY_NOT_WORK_CITY       0  0  0  0  1
REG_REGION_NOT_LIVE_REGION   0  0  0  0  0
REG_REGION_NOT_WORK_REGION   0  0  0  0  0
TARGET                       1  0  0  0  0

In [52]:
name_number = 1

In [53]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].head().T # application_test

                             0  1  2  3  4
CODE_GENDER                  1  0  0  1  0
FLAG_CONT_MOBILE             1  1  1  1  1
FLAG_DOCUMENT_11             0  0  0  0  0
FLAG_DOCUMENT_18             0  0  0  0  0
FLAG_DOCUMENT_3              1  1  0  1  1
FLAG_DOCUMENT_4              0  0  0  0  0
FLAG_DOCUMENT_5              0  0  0  0  0
FLAG_DOCUMENT_6              0  0  0  0  0
FLAG_DOCUMENT_7              0  0  0  0  0
FLAG_DOCUMENT_8              0  0  1  0  0
FLAG_DOCUMENT_9              0  0  0  0  0
FLAG_EMAIL                   1  0  0  0  0
FLAG_EMP_PHONE               1  1  1  1  1
FLAG_MOBIL                   1  1  1  1  1
FLAG_OWN_CAR                 0  0  1  0  1
FLAG_OWN_REALTY              1  1  1  1  0
FLAG_PHONE                   0  0  0  1  0
FLAG_WORK_PHONE              0  0  0  0  1
LIVE_CITY_NOT_WORK_CITY      0  0  0  0  1
LIVE_REGION_NOT_WORK_REGION  0  0  0  0  0
NAME_CONTRACT_TYPE           1  1  1  1  1
REG_CITY_NOT_LIVE_CITY       0  0  0  0  0
REG_CITY_NOT_WORK_CITY       0  0  0  0  1
REG_REGION_NOT_LIVE_REGION   0  0  0  0  0
REG_REGION_NOT_WORK_REGION   0  0  0  0  0

In [54]:
name_number = 2

In [55]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].head().T # bureau

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

In [56]:
name_number = 3

In [57]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].head().T # bureau_balance

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

In [58]:
name_number = 4

In [59]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].head().T # credit_card_balance

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

In [60]:
name_number = 5

In [61]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].head().T # installments_payments

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

In [62]:
name_number = 6

In [63]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].head().T # POS_CASH_balance

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

In [64]:
name_number = 7

In [65]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].head().T # previous_application

                             0  1  2  3  4
FLAG_LAST_APPL_PER_CONTRACT  1  1  1  1  1
NFLAG_LAST_APPL_IN_DAY       1  1  1  1  1

In [66]:
name_number = 8

In [67]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].head().T # sample_submission

Empty DataFrame
Columns: [0, 1, 2, 3, 4]
Index: []

# Info

## Numeric columns

In [68]:
name_number = 0

In [69]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 307507 entries, 0 to 307506
Data columns (total 11 columns):
AMT_CREDIT                    307507 non-null float64
AMT_INCOME_TOTAL              307507 non-null float64
CNT_CHILDREN                  307507 non-null int64
DAYS_BIRTH                    307507 non-null int64
DAYS_EMPLOYED                 307507 non-null int64
DAYS_ID_PUBLISH               307507 non-null int64
DAYS_REGISTRATION             307507 non-null float64
HOUR_APPR_PROCESS_START       307507 non-null int64
REGION_POPULATION_RELATIVE    307507 non-null float64
REGION_RATING_CLIENT          307507 non-null int64
SK_ID_CURR                    307507 non-null int64
dtypes: float64(4), int64(7)
memory usage: 25.8 MB

In [70]:
name_number = 1

In [71]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48744 entries, 0 to 48743
Data columns (total 13 columns):
AMT_CREDIT                    48744 non-null float64
AMT_INCOME_TOTAL              48744 non-null float64
CNT_CHILDREN                  48744 non-null int64
CNT_FAM_MEMBERS               48744 non-null float64
DAYS_BIRTH                    48744 non-null int64
DAYS_EMPLOYED                 48744 non-null int64
DAYS_ID_PUBLISH               48744 non-null int64
DAYS_LAST_PHONE_CHANGE        48744 non-null float64
DAYS_REGISTRATION             48744 non-null float64
HOUR_APPR_PROCESS_START       48744 non-null int64
REGION_POPULATION_RELATIVE    48744 non-null float64
REGION_RATING_CLIENT          48744 non-null int64
SK_ID_CURR                    48744 non-null int64
dtypes: float64(6), int64(7)
memory usage: 4.8 MB

In [72]:
name_number = 2

In [73]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1716428 entries, 0 to 1716427
Data columns (total 7 columns):
AMT_CREDIT_SUM_OVERDUE    1716428 non-null float64
CNT_CREDIT_PROLONG        1716428 non-null int64
CREDIT_DAY_OVERDUE        1716428 non-null int64
DAYS_CREDIT               1716428 non-null int64
DAYS_CREDIT_UPDATE        1716428 non-null int64
SK_ID_BUREAU              1716428 non-null int64
SK_ID_CURR                1716428 non-null int64
dtypes: float64(1), int64(6)
memory usage: 91.7 MB

In [74]:
name_number = 3

In [75]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27299925 entries, 0 to 27299924
Data columns (total 2 columns):
MONTHS_BALANCE    27299925 non-null int64
SK_ID_BUREAU      27299925 non-null int64
dtypes: int64(2)
memory usage: 416.6 MB

In [76]:
name_number = 4

In [77]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3840312 entries, 0 to 3840311
Data columns (total 9 columns):
AMT_BALANCE                3840312 non-null float64
AMT_CREDIT_LIMIT_ACTUAL    3840312 non-null int64
AMT_DRAWINGS_CURRENT       3840312 non-null float64
CNT_DRAWINGS_CURRENT       3840312 non-null int64
MONTHS_BALANCE             3840312 non-null int64
SK_DPD                     3840312 non-null int64
SK_DPD_DEF                 3840312 non-null int64
SK_ID_CURR                 3840312 non-null int64
SK_ID_PREV                 3840312 non-null int64
dtypes: float64(2), int64(7)
memory usage: 263.7 MB

In [78]:
name_number = 5

In [79]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13605401 entries, 0 to 13605400
Data columns (total 6 columns):
AMT_INSTALMENT            13605401 non-null float64
DAYS_INSTALMENT           13605401 non-null float64
NUM_INSTALMENT_NUMBER     13605401 non-null int64
NUM_INSTALMENT_VERSION    13605401 non-null float64
SK_ID_CURR                13605401 non-null int64
SK_ID_PREV                13605401 non-null int64
dtypes: float64(3), int64(3)
memory usage: 622.8 MB

In [80]:
name_number = 6

In [81]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10001358 entries, 0 to 10001357
Data columns (total 5 columns):
MONTHS_BALANCE    10001358 non-null int64
SK_DPD            10001358 non-null int64
SK_DPD_DEF        10001358 non-null int64
SK_ID_CURR        10001358 non-null int64
SK_ID_PREV        10001358 non-null int64
dtypes: int64(5)
memory usage: 381.5 MB

In [82]:
name_number = 7

In [83]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1670214 entries, 0 to 1670213
Data columns (total 6 columns):
AMT_APPLICATION            1670214 non-null float64
DAYS_DECISION              1670214 non-null int64
HOUR_APPR_PROCESS_START    1670214 non-null int64
SELLERPLACE_AREA           1670214 non-null int64
SK_ID_CURR                 1670214 non-null int64
SK_ID_PREV                 1670214 non-null int64
dtypes: float64(1), int64(5)
memory usage: 76.5 MB

In [84]:
name_number = 8

In [85]:
data_dict[dataset_names[name_number]][datasets_num_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48744 entries, 0 to 48743
Data columns (total 1 columns):
SK_ID_CURR    48744 non-null int64
dtypes: int64(1)
memory usage: 380.9 KB

## Categorical columns

In [86]:
name_number = 0

In [87]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 307507 entries, 0 to 307506
Data columns (total 6 columns):
NAME_EDUCATION_TYPE           307507 non-null object
NAME_FAMILY_STATUS            307507 non-null object
NAME_HOUSING_TYPE             307507 non-null object
NAME_INCOME_TYPE              307507 non-null object
ORGANIZATION_TYPE             307507 non-null object
WEEKDAY_APPR_PROCESS_START    307507 non-null object
dtypes: object(6)
memory usage: 14.1+ MB

In [88]:
name_number = 1

In [89]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48744 entries, 0 to 48743
Data columns (total 6 columns):
NAME_EDUCATION_TYPE           48744 non-null object
NAME_FAMILY_STATUS            48744 non-null object
NAME_HOUSING_TYPE             48744 non-null object
NAME_INCOME_TYPE              48744 non-null object
ORGANIZATION_TYPE             48744 non-null object
WEEKDAY_APPR_PROCESS_START    48744 non-null object
dtypes: object(6)
memory usage: 2.2+ MB

In [90]:
name_number = 2

In [91]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1716428 entries, 0 to 1716427
Data columns (total 3 columns):
CREDIT_ACTIVE      1716428 non-null object
CREDIT_CURRENCY    1716428 non-null object
CREDIT_TYPE        1716428 non-null object
dtypes: object(3)
memory usage: 39.3+ MB

In [92]:
name_number = 3

In [93]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27299925 entries, 0 to 27299924
Data columns (total 1 columns):
STATUS    27299925 non-null object
dtypes: object(1)
memory usage: 208.3+ MB

In [94]:
name_number = 4

In [95]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3840312 entries, 0 to 3840311
Data columns (total 1 columns):
NAME_CONTRACT_STATUS    3840312 non-null object
dtypes: object(1)
memory usage: 29.3+ MB

In [96]:
name_number = 5

In [97]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13605401 entries, 0 to 13605400
Empty DataFrame

In [98]:
name_number = 6

In [99]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10001358 entries, 0 to 10001357
Data columns (total 1 columns):
NAME_CONTRACT_STATUS    10001358 non-null object
dtypes: object(1)
memory usage: 76.3+ MB

In [100]:
name_number = 7

In [101]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1670214 entries, 0 to 1670213
Data columns (total 13 columns):
CHANNEL_TYPE                  1670214 non-null object
CODE_REJECT_REASON            1670214 non-null object
NAME_CASH_LOAN_PURPOSE        1670214 non-null object
NAME_CLIENT_TYPE              1670214 non-null object
NAME_CONTRACT_STATUS          1670214 non-null object
NAME_CONTRACT_TYPE            1670214 non-null object
NAME_GOODS_CATEGORY           1670214 non-null object
NAME_PAYMENT_TYPE             1670214 non-null object
NAME_PORTFOLIO                1670214 non-null object
NAME_PRODUCT_TYPE             1670214 non-null object
NAME_SELLER_INDUSTRY          1670214 non-null object
NAME_YIELD_GROUP              1670214 non-null object
WEEKDAY_APPR_PROCESS_START    1670214 non-null object
dtypes: object(13)
memory usage: 165.7+ MB

In [102]:
name_number = 8

In [103]:
data_dict[dataset_names[name_number]][datasets_cat_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48744 entries, 0 to 48743
Empty DataFrame

## Binary columns

In [104]:
name_number = 0

In [105]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 307507 entries, 0 to 307506
Data columns (total 37 columns):
CODE_GENDER                    307507 non-null int64
FLAG_CONT_MOBILE               307507 non-null int64
FLAG_DOCUMENT_10               307507 non-null int64
FLAG_DOCUMENT_11               307507 non-null int64
FLAG_DOCUMENT_12               307507 non-null int64
FLAG_DOCUMENT_13               307507 non-null int64
FLAG_DOCUMENT_14               307507 non-null int64
FLAG_DOCUMENT_15               307507 non-null int64
FLAG_DOCUMENT_16               307507 non-null int64
FLAG_DOCUMENT_17               307507 non-null int64
FLAG_DOCUMENT_18               307507 non-null int64
FLAG_DOCUMENT_19               307507 non-null int64
FLAG_DOCUMENT_2                307507 non-null int64
FLAG_DOCUMENT_20               307507 non-null int64
FLAG_DOCUMENT_21               307507 non-null int64
FLAG_DOCUMENT_3                307507 non-null int64
FLAG_DOCUMENT_4                307507 non-null int64
FLAG_DOCUMENT_5                307507 non-null int64
FLAG_DOCUMENT_6                307507 non-null int64
FLAG_DOCUMENT_7                307507 non-null int64
FLAG_DOCUMENT_8                307507 non-null int64
FLAG_DOCUMENT_9                307507 non-null int64
FLAG_EMAIL                     307507 non-null int64
FLAG_EMP_PHONE                 307507 non-null int64
FLAG_MOBIL                     307507 non-null int64
FLAG_OWN_CAR                   307507 non-null int64
FLAG_OWN_REALTY                307507 non-null int64
FLAG_PHONE                     307507 non-null int64
FLAG_WORK_PHONE                307507 non-null int64
LIVE_CITY_NOT_WORK_CITY        307507 non-null int64
LIVE_REGION_NOT_WORK_REGION    307507 non-null int64
NAME_CONTRACT_TYPE             307507 non-null int64
REG_CITY_NOT_LIVE_CITY         307507 non-null int64
REG_CITY_NOT_WORK_CITY         307507 non-null int64
REG_REGION_NOT_LIVE_REGION     307507 non-null int64
REG_REGION_NOT_WORK_REGION     307507 non-null int64
TARGET                         307507 non-null int64
dtypes: int64(37)
memory usage: 86.8 MB

In [106]:
name_number = 1

In [107]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48744 entries, 0 to 48743
Data columns (total 25 columns):
CODE_GENDER                    48744 non-null int64
FLAG_CONT_MOBILE               48744 non-null int64
FLAG_DOCUMENT_11               48744 non-null int64
FLAG_DOCUMENT_18               48744 non-null int64
FLAG_DOCUMENT_3                48744 non-null int64
FLAG_DOCUMENT_4                48744 non-null int64
FLAG_DOCUMENT_5                48744 non-null int64
FLAG_DOCUMENT_6                48744 non-null int64
FLAG_DOCUMENT_7                48744 non-null int64
FLAG_DOCUMENT_8                48744 non-null int64
FLAG_DOCUMENT_9                48744 non-null int64
FLAG_EMAIL                     48744 non-null int64
FLAG_EMP_PHONE                 48744 non-null int64
FLAG_MOBIL                     48744 non-null int64
FLAG_OWN_CAR                   48744 non-null int64
FLAG_OWN_REALTY                48744 non-null int64
FLAG_PHONE                     48744 non-null int64
FLAG_WORK_PHONE                48744 non-null int64
LIVE_CITY_NOT_WORK_CITY        48744 non-null int64
LIVE_REGION_NOT_WORK_REGION    48744 non-null int64
NAME_CONTRACT_TYPE             48744 non-null int64
REG_CITY_NOT_LIVE_CITY         48744 non-null int64
REG_CITY_NOT_WORK_CITY         48744 non-null int64
REG_REGION_NOT_LIVE_REGION     48744 non-null int64
REG_REGION_NOT_WORK_REGION     48744 non-null int64
dtypes: int64(25)
memory usage: 9.3 MB

In [108]:
name_number = 2

In [109]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1716428 entries, 0 to 1716427
Empty DataFrame

In [110]:
name_number = 3

In [111]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27299925 entries, 0 to 27299924
Empty DataFrame

In [112]:
name_number = 4

In [113]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3840312 entries, 0 to 3840311
Empty DataFrame

In [114]:
name_number = 5

In [115]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13605401 entries, 0 to 13605400
Empty DataFrame

In [116]:
name_number = 6

In [117]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10001358 entries, 0 to 10001357
Empty DataFrame

In [118]:
name_number = 7

In [119]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1670214 entries, 0 to 1670213
Data columns (total 2 columns):
FLAG_LAST_APPL_PER_CONTRACT    1670214 non-null int64
NFLAG_LAST_APPL_IN_DAY         1670214 non-null int64
dtypes: int64(2)
memory usage: 25.5 MB

In [120]:
name_number = 8

In [121]:
data_dict[dataset_names[name_number]][datasets_bin_features[dataset_names[name_number]]].info(verbose=10, null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48744 entries, 0 to 48743
Empty DataFrame